app/controllers/stories_controller.rb

  def create
    @story = Story.new(params[:story])
    @story.user = @current_user
    if @story.save
---
INSERT INTO "stories" ("updated_at", "title", "body", "user_id", "created_at") VALUES('2010-06-03 04:37:16', NULL, NULL, 1, '2010-06-03 04:37:16')

  def show
    @story = Story.find(params[:id])
---
SELECT * FROM "stories" WHERE ("stories"."id" = 2)

  def edit
    @story = @current_user.stories.find(params[:id])
---
SELECT * FROM "stories" WHERE ("stories"."id" = 2 AND ("stories".user_id = 1))

  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    @story = @current_user.stories.find(params[:id])
    if @story.update_attributes(params[:story])
---
SELECT * FROM "stories" WHERE ("stories"."id" = 2 AND ("stories".user_id = 1))
UPDATE "stories" SET "body" = '<story title="joseph kittinger" schema="1" version="1">